***

# **European Soccer Analysis**

The dataset used was downloaded from __[Kaggle](https://www.kaggle.com/hugomathien/soccer)__. It's an SQLite database file that contains several tables about European soccer, including match details from 2008 to 2016.<br>The contents of this Notebook are:

1. Database Preparation
2. Data Exploration

***

# **Database Preparation**

I want to demonstrate my ability to use PostgreSQL dialect, so here I'm converting the SQL database file to PostgreSQL database

**Importing libraries**

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import sqlalchemy
import sqlite3

**Connecting to the SQLite database file (.sqlite)**

In [2]:
database = r"C:\Users\DAFFA ZAIDAN NABIL\Desktop\datascience\portfolio\Soccer\database.sqlite"
conn = sqlite3.connect(database)

**Connecting to the PostgreSQL database**

In [3]:
engine = sqlalchemy.create_engine('postgresql://postgres:21111998@localhost:5432/EuropeanSoccerDatabase')
%reload_ext sql
%sql postgresql://postgres:21111998@localhost:5432/EuropeanSoccerDatabase

**Migrating the SQLite Database File to PostgreSQL Database**

I only migrating necessary tables and columns (via Pandas DataFrame)

In [4]:
df = pd.read_sql_query("SELECT * from Match", conn)
df[df.columns[:11]].to_sql("match", con=engine, dtype={"date": sqlalchemy.types.Date()}, if_exists='replace', index=False)

In [5]:
df = pd.read_sql_query("SELECT * from Team", conn)
df.drop(columns='team_fifa_api_id').to_sql("team", con=engine, if_exists='replace', index=False)

In [6]:
df = pd.read_sql_query("SELECT * from Country", conn)
df.to_sql("country", con=engine, if_exists='replace', index=False)

In [7]:
df = pd.read_sql_query("SELECT * from League", conn)
df.to_sql("league", con=engine, if_exists='replace', index=False)

I only have to do this database migration once

# Start Exploring!

There should be more efficient ways to get the insights, but I didn't use it because I made this notebook to demonstrate my ability to use different kinds of queries

**Creating 'table viewer' function**

I use this function that utilize Pandas DataFrame, just to make everything tidy in this Jupyter Notebook

In [8]:
def query(q, n=None):
    return pd.read_sql_query(q, engine).head(n)

### **Looking for the tables**

**Match**

In [9]:
query('''
---------

SELECT * FROM match;

---------
''')

,id,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,away_team_goal
0,1,1,1,2008/2009,1,2008-08-17,492473,9987,9993,1,1
1,2,1,1,2008/2009,1,2008-08-16,492474,10000,9994,0,0
2,3,1,1,2008/2009,1,2008-08-16,492475,9984,8635,0,3
3,4,1,1,2008/2009,1,2008-08-17,492476,9991,9998,5,0
4,5,1,1,2008/2009,1,2008-08-16,492477,7947,9985,1,3
...,...,...,...,...,...,...,...,...,...,...,...
25974,25975,24558,24558,2015/2016,9,2015-09-22,1992091,10190,10191,1,0
25975,25976,24558,24558,2015/2016,9,2015-09-23,1992092,9824,10199,1,2
25976,25977,24558,24558,2015/2016,9,2015-09-23,1992093,9956,10179,2,0
25977,25978,24558,24558,2015/2016,9,2015-09-22,1992094,7896,10243,0,0
25978,25979,24558,24558,2015/2016,9,2015-09-23,1992095,10192,9931,4,3

**Team**

In [10]:
query('''
---------

SELECT * FROM team;

---------
''')

        id  team_api_id      team_long_name team_short_name
0        1         9987            KRC Genk             GEN
1        2         9993        Beerschot AC             BAC
2        3        10000    SV Zulte-Waregem             ZUL
3        4         9994    Sporting Lokeren             LOK
4        5         9984   KSV Cercle Brugge             CEB
..     ...          ...                 ...             ...
294  49479        10190       FC St. Gallen             GAL
295  49837        10191             FC Thun             THU
296  50201         9777         Servette FC             SER
297  50204         7730  FC Lausanne-Sports             LAU
298  51606         7896              Lugano             LUG

[299 rows x 4 columns]

**League**

In [11]:
query('''
---------

SELECT * FROM league;

---------
''')

       id  country_id                      name
0       1           1    Belgium Jupiler League
1    1729        1729    England Premier League
2    4769        4769            France Ligue 1
3    7809        7809     Germany 1. Bundesliga
4   10257       10257             Italy Serie A
5   13274       13274    Netherlands Eredivisie
6   15722       15722        Poland Ekstraklasa
7   17642       17642  Portugal Liga ZON Sagres
8   19694       19694   Scotland Premier League
9   21518       21518           Spain LIGA BBVA
10  24558       24558  Switzerland Super League

**Country**

In [12]:
query('''
---------

SELECT * FROM country;

---------
''')

       id         name
0       1      Belgium
1    1729      England
2    4769       France
3    7809      Germany
4   10257        Italy
5   13274  Netherlands
6   15722       Poland
7   17642     Portugal
8   19694     Scotland
9   21518        Spain
10  24558  Switzerland

### **Simple Subqueries**

**Simple subquery in WHERE**

Creating a list of teams that scored 8 or more goals in a home match

In [13]:
query('''
---------

SELECT
	team_long_name,
	team_short_name
FROM team
WHERE team_api_id IN
	  (SELECT home_team_api_id 
       FROM match
       WHERE home_team_goal >= 8);

---------
''')

      team_long_name team_short_name
0  Manchester United             MUN
1  Tottenham Hotspur             TOT
2            Chelsea             CHE
3        Southampton             SOU
4   FC Bayern Munich             BMU
5                PSV             PSV
6         SL Benfica             BEN
7             Celtic             CEL
8     Real Madrid CF             REA
9       FC Barcelona             BAR

**Simple subquery in FROM**

Matches in each country where the total goals was higher than 10

In [14]:
query('''
---------

SELECT
    country, date, home_team_goal, away_team_goal
FROM 
	(SELECT c.name AS country, m.date, m.home_team_goal, m.away_team_goal, (m.home_team_goal + m.away_team_goal) AS total_goals
     FROM match AS m
     LEFT JOIN country AS c ON m.country_id = c.id) AS subq
WHERE total_goals >= 10;

---------
''')

        country        date  home_team_goal  away_team_goal
0       England  2009-11-22               9               1
1       England  2011-08-28               8               2
2       England  2012-12-29               7               3
3       England  2013-05-19               5               5
4        France  2009-11-08               5               5
5       Germany  2013-03-30               9               2
6   Netherlands  2010-10-24              10               0
7   Netherlands  2011-11-06               6               4
8      Scotland  2010-05-05               6               6
9         Spain  2013-10-30               7               3
10        Spain  2015-04-05               9               1
11        Spain  2015-05-23               7               3
12        Spain  2014-09-20               2               8
13        Spain  2015-12-20              10               2

**Subquery in SELECT**

Difference of each league's average total goals to the overall average goals in the 2013/2014 season

In [15]:
query('''
---------

SELECT
	l.name AS league,
	ROUND(AVG(m.home_team_goal + m.away_team_goal),2) AS avg_goals,
	ROUND(AVG(m.home_team_goal + m.away_team_goal) - 
		(SELECT AVG(home_team_goal + away_team_goal)
		 FROM match 
         WHERE season = '2013/2014'),2) AS diff
FROM league AS l
LEFT JOIN match AS m ON l.country_id = m.country_id
WHERE season = '2013/2014'
GROUP BY l.name;

---------
''')

                      league  avg_goals  diff
0   Switzerland Super League       2.89  0.12
1         Poland Ekstraklasa       2.64 -0.13
2     Netherlands Eredivisie       3.20  0.43
3    Scotland Premier League       2.75 -0.02
4             France Ligue 1       2.46 -0.31
5            Spain LIGA BBVA       2.75 -0.02
6      Germany 1. Bundesliga       3.16  0.39
7              Italy Serie A       2.72 -0.04
8   Portugal Liga ZON Sagres       2.37 -0.40
9     England Premier League       2.77  0.00
10    Belgium Jupiler League       2.50 -0.27

**Subquery in SELECT, FROM, and WHERE**

Generate a list of stages that have higher than average goals scored in matches

In [16]:
query('''
---------

SELECT stage, ROUND(s.avg_goals,2) AS avg_goal, (SELECT AVG(home_team_goal + away_team_goal) 
                                                 FROM match
                                                 WHERE season = '2012/2013') AS overall_avg
FROM (SELECT stage, AVG(home_team_goal + away_team_goal) AS avg_goals
	  FROM match
	  WHERE season = '2012/2013'
	  GROUP BY stage) AS s
WHERE s.avg_goals > (SELECT AVG(home_team_goal + away_team_goal) 
                     FROM match WHERE season = '2012/2013');

---------
''')

    stage  avg_goal  overall_avg
0       3      2.83     2.772699
1       4      2.80     2.772699
2       6      2.78     2.772699
3       8      3.09     2.772699
4      10      2.96     2.772699
5      11      2.92     2.772699
6      12      3.23     2.772699
7      17      2.85     2.772699
8      20      2.96     2.772699
9      21      2.90     2.772699
10     23      3.01     2.772699
11     27      2.80     2.772699
12     30      2.87     2.772699
13     31      3.06     2.772699
14     33      3.10     2.772699
15     36      2.90     2.772699
16     38      3.17     2.772699

# Other Subqueries

### Correlated subquery

What was the highest scoring match for each country, in each season?

In [17]:
query('''
---------

SELECT main.country_id, main.date, main.home_team_goal, main.away_team_goal
FROM match AS main
WHERE (home_team_goal + away_team_goal) = (SELECT MAX(sub.home_team_goal + sub.away_team_goal)
                                           FROM match AS sub
                                           WHERE main.country_id = sub.country_id AND main.season = sub.season);

---------
''')

     country_id        date  home_team_goal  away_team_goal
0             1  2008-10-25               7               1
1             1  2009-12-04               2               5
2             1  2009-12-26               5               2
3             1  2010-11-20               4               4
4             1  2010-09-19               5               3
..          ...         ...             ...             ...
148       24558  2014-02-16               5               3
149       24558  2015-04-30               6               2
150       24558  2015-05-03               2               6
151       24558  2015-05-25               6               2
152       24558  2016-04-17               5               4

[153 rows x 4 columns]

### Nested subquery

What's the average number of matches per season where a team scored 5 or more goals? How does this differ by country?

In [18]:
query('''
---------

SELECT c.name AS country, AVG(outer_s.matches) AS avg_seasonal_high_scores
FROM country AS c
LEFT JOIN (SELECT country_id, season, COUNT(id) AS matches
           FROM (SELECT country_id, season, id
                 FROM match
                 WHERE home_team_goal >= 5 OR away_team_goal >= 5) AS inner_s
                 GROUP BY country_id, season) AS outer_s ON c.id = outer_s.country_id
GROUP BY country;

---------
''')

        country  avg_seasonal_high_scores
0      Portugal                  8.625000
1        France                  8.000000
2      Scotland                  7.125000
3   Netherlands                 20.125000
4         Spain                 19.125000
5       Belgium                  9.571429
6         Italy                  8.500000
7       Germany                 13.750000
8       England                 14.500000
9   Switzerland                  8.000000
10       Poland                  5.857143

### Common Table Expressions (CTE)

Matches with more than 10 total goals

In [19]:
query('''
---------

WITH match_list AS (SELECT l.name AS league, m.date, m.home_team_goal, m.away_team_goal, (m.home_team_goal + m.away_team_goal) AS total_goals
                    FROM match AS m
                    LEFT JOIN league as l ON m.country_id = l.id)
                    
SELECT league, date, home_team_goal, away_team_goal
FROM match_list
WHERE total_goals >= 10;

---------
''')

                     league        date  home_team_goal  away_team_goal
0    England Premier League  2009-11-22               9               1
1    England Premier League  2011-08-28               8               2
2    England Premier League  2012-12-29               7               3
3    England Premier League  2013-05-19               5               5
4            France Ligue 1  2009-11-08               5               5
5     Germany 1. Bundesliga  2013-03-30               9               2
6    Netherlands Eredivisie  2010-10-24              10               0
7    Netherlands Eredivisie  2011-11-06               6               4
8   Scotland Premier League  2010-05-05               6               6
9           Spain LIGA BBVA  2013-10-30               7               3
10          Spain LIGA BBVA  2015-04-05               9               1
11          Spain LIGA BBVA  2015-05-23               7               3
12          Spain LIGA BBVA  2014-09-20               2               8
13          Spain LIGA BBVA  2015-12-20              10               2

# Window

### Simple window (OVER)

Calculate the average number of goals scored overall and then includes the aggregate value in each row

In [20]:
query('''
---------

SELECT m.id, c.name AS country, m.season, m.home_team_goal, m.away_team_goal, AVG(m.home_team_goal + m.away_team_goal) OVER() AS overall_avg
FROM match AS m
LEFT JOIN country AS c ON m.country_id = c.id;

---------
''')

,id,country,season,home_team_goal,away_team_goal,overall_avg
0,1,Belgium,2008/2009,1,1,2.705531
1,2,Belgium,2008/2009,0,0,2.705531
2,3,Belgium,2008/2009,0,3,2.705531
3,4,Belgium,2008/2009,5,0,2.705531
4,5,Belgium,2008/2009,1,3,2.705531
...,...,...,...,...,...,...
25974,25975,Switzerland,2015/2016,1,0,2.705531
25975,25976,Switzerland,2015/2016,1,2,2.705531
25976,25977,Switzerland,2015/2016,2,0,2.705531
25977,25978,Switzerland,2015/2016,0,0,2.705531
25978,25979,Switzerland,2015/2016,4,3,2.705531

### Window with rank

Rank matches according to which leagues, on average, score the most goals in a match

In [21]:
query('''
---------

SELECT l.name AS league, AVG(m.home_team_goal + m.away_team_goal) AS avg_goals,
       RANK() OVER(ORDER BY AVG(m.home_team_goal + m.away_team_goal) DESC) AS league_rank
FROM league AS l
LEFT JOIN match AS m ON l.id = m.country_id
WHERE m.season = '2011/2012'
GROUP BY l.name
ORDER BY league_rank;

---------
''')

                      league  avg_goals  league_rank
0     Netherlands Eredivisie   3.258170            1
1     Belgium Jupiler League   2.879167            2
2      Germany 1. Bundesliga   2.859477            3
3     England Premier League   2.805263            4
4            Spain LIGA BBVA   2.763158            5
5   Portugal Liga ZON Sagres   2.641667            6
6    Scotland Premier League   2.635965            7
7   Switzerland Super League   2.623457            8
8              Italy Serie A   2.583799            9
9             France Ligue 1   2.515789           10
10        Poland Ekstraklasa   2.195833           11

### Window partitioned

Calculate the average number home and away goals scored Legia Warszawa, and their opponents, partitioned by the month in each season

In [22]:
query('''
---------

SELECT date, season, home_team_goal, away_team_goal,
       CASE WHEN home_team_api_id = 8673 THEN 'home' ELSE 'away' END AS warsaw_location,
       AVG(home_team_goal) OVER(PARTITION BY season, EXTRACT(MONTH FROM date)) AS season_mo_home,
       AVG(away_team_goal) OVER(PARTITION BY season, EXTRACT(MONTH FROM date)) AS season_mo_away
FROM match
WHERE home_team_api_id = 8673 OR away_team_api_id = 8673
ORDER BY (home_team_goal + away_team_goal) DESC;

---------
''')

,date,season,home_team_goal,away_team_goal,warsaw_location,season_mo_home,season_mo_away
0,2013-09-14,2013/2014,3,5,away,2.25,2.500000
1,2009-10-24,2009/2010,5,2,home,2.50,0.750000
2,2014-09-13,2014/2015,4,3,home,2.00,2.666667
3,2011-05-25,2010/2011,2,5,away,2.00,1.166667
4,2011-02-25,2010/2011,3,3,away,3.00,3.000000
...,...,...,...,...,...,...,...
235,2011-11-07,2011/2012,0,0,away,1.75,0.000000
236,2013-04-27,2012/2013,0,0,away,1.50,0.750000
237,2011-12-10,2011/2012,0,0,home,0.00,2.000000
238,2016-04-09,2015/2016,0,0,away,0.50,0.500000
239,2009-02-27,2008/2009,0,0,away,0.00,0.000000

### Sliding window

Calculating the running total of goals scored by the FC Utrecht when they were the home team during the 2011/2012 season

In [23]:
query('''
---------

SELECT date, home_team_goal, away_team_goal,
       SUM(home_team_goal) OVER(ORDER BY date ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total,
       AVG(home_team_goal) OVER(ORDER BY date ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_avg
FROM match
WHERE home_team_api_id = 9908 AND season = '2011/2012';

---------
''')

          date  home_team_goal  away_team_goal  running_total  running_avg
0   2011-08-14               2               2            2.0     2.000000
1   2011-08-27               3               1            5.0     2.500000
2   2011-09-18               2               2            7.0     2.333333
3   2011-10-01               3               0           10.0     2.500000
4   2011-10-22               1               4           11.0     2.200000
5   2011-11-06               6               4           17.0     2.833333
6   2011-12-04               2               6           19.0     2.714286
7   2011-12-11               2               2           21.0     2.625000
8   2012-01-22               1               1           22.0     2.444444
9   2012-02-12               1               1           23.0     2.300000
10  2012-02-19               3               0           26.0     2.363636
11  2012-03-04               0               0           26.0     2.166667
12  2012-03-18               3               1           29.0     2.230769
13  2012-03-30               3               2           32.0     2.285714
14  2012-04-15               4               2           36.0     2.400000
15  2012-04-28               1               3           37.0     2.312500
16  2012-05-02               2               2           39.0     2.294118

Calculating the running total of goals scored by the FC Utrecht when they were the away team during the 2011/2012 season. Do they score more goals at the end of the season as the home or away team?

In [24]:
query('''
---------

SELECT date, home_team_goal, away_team_goal,
       SUM(home_team_goal) OVER(ORDER BY date DESC ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) AS running_total,
       AVG(home_team_goal) OVER(ORDER BY date DESC ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) AS running_avg
FROM match
WHERE away_team_api_id = 9908 AND season = '2011/2012';

---------
''')

          date  home_team_goal  away_team_goal  running_total  running_avg
0   2012-05-06               1               3           25.0     1.470588
1   2012-04-21               0               2           24.0     1.500000
2   2012-04-12               3               0           24.0     1.600000
3   2012-03-25               3               1           21.0     1.500000
4   2012-03-11               1               1           18.0     1.384615
5   2012-02-26               1               0           17.0     1.416667
6   2012-02-05               0               2           16.0     1.454545
7   2012-01-28               2               0           16.0     1.600000
8   2011-12-17               1               0           14.0     1.555556
9   2011-11-25               2               0           13.0     1.625000
10  2011-11-20               2               2           11.0     1.571429
11  2011-10-30               3               1            9.0     1.500000
12  2011-10-15               1               0            6.0     1.200000
13  2011-09-24               1               0            5.0     1.250000
14  2011-09-11               2               3            4.0     1.333333
15  2011-08-20               2               1            2.0     1.000000
16  2011-08-06               0               0            0.0     0.000000

### Put it all together

Generate a list of matches in which Manchester United was defeated during the 2014/2015 English Premier League season. How badly did Manchester United lose in each match?

In [25]:
query('''
---------

WITH home AS (SELECT m.id, t.team_long_name, CASE WHEN m.home_team_goal > m.away_team_goal THEN 'MU Win'
                                                  WHEN m.home_team_goal < m.away_team_goal THEN 'MU Loss' 
                                                  ELSE 'Tie' END AS outcome
              FROM match AS m
              LEFT JOIN team AS t ON m.home_team_api_id = t.team_api_id),
     away AS (SELECT m.id, t.team_long_name, CASE WHEN m.home_team_goal > m.away_team_goal THEN 'MU Loss'
                                                  WHEN m.home_team_goal < m.away_team_goal THEN 'MU Win' 
                                                  ELSE 'Tie' END AS outcome
              FROM match AS m
              LEFT JOIN team AS t ON m.away_team_api_id = t.team_api_id)

SELECT DISTINCT date, home.team_long_name AS home_team, away.team_long_name AS away_team, m.home_team_goal, m.away_team_goal,
                RANK() OVER(ORDER BY ABS(home_team_goal - away_team_goal) DESC) as match_rank
FROM match AS m
LEFT JOIN home ON m.id = home.id
LEFT JOIN away ON m.id = away.id
WHERE m.season = '2014/2015' AND ((home.team_long_name = 'Manchester United' AND home.outcome = 'MU Loss') OR (away.team_long_name = 'Manchester United' AND away.outcome = 'MU Loss'));

---------
''')

,date,home_team,away_team,home_team_goal,away_team_goal,match_rank
0,2014-08-16,Manchester United,Swansea City,1,2,3
1,2014-09-21,Leicester City,Manchester United,5,3,2
2,2014-11-02,Manchester City,Manchester United,1,0,3
3,2015-01-11,Manchester United,Southampton,0,1,3
4,2015-02-21,Swansea City,Manchester United,2,1,3
5,2015-04-18,Chelsea,Manchester United,1,0,3
6,2015-04-26,Everton,Manchester United,3,0,1
7,2015-05-02,Manchester United,West Bromwich Albion,0,1,3